{
  "nodes": [
    {
      "op": "null", 
      "param": {}, 
      "name": "data", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15057_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15057_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15057", 
      "inputs": [[0, 0], [1, 0], [2, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15057_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15057_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15057", 
      "inputs": [[3, 0], [4, 0], [5, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13623", 
      "inputs": [[6, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15058_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15058_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15058", 
      "inputs": [[7, 0], [8, 0], [9, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15058_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15058_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15058", 
      "inputs": [[10, 0], [11, 0], [12, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13624", 
      "inputs": [[13, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15059_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15059_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15059", 
      "inputs": [[14, 0], [15, 0], [16, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15059_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15059_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15059", 
      "inputs": [[17, 0], [18, 0], [19, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus6453", 
      "inputs": [[7, 0], [20, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13625", 
      "inputs": [[21, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15060_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15060_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15060", 
      "inputs": [[22, 0], [23, 0], [24, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15060_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15060_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15060", 
      "inputs": [[25, 0], [26, 0], [27, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13626", 
      "inputs": [[28, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15061_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15061_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15061", 
      "inputs": [[29, 0], [30, 0], [31, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15061_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15061_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15061", 
      "inputs": [[32, 0], [33, 0], [34, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus6454", 
      "inputs": [[22, 0], [35, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13627", 
      "inputs": [[36, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15062_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15062_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15062", 
      "inputs": [[37, 0], [38, 0], [39, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15062_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15062_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15062", 
      "inputs": [[40, 0], [41, 0], [42, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13628", 
      "inputs": [[43, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15063_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15063_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15063", 
      "inputs": [[44, 0], [45, 0], [46, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15063_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15063_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15063", 
      "inputs": [[47, 0], [48, 0], [49, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus6455", 
      "inputs": [[37, 0], [50, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13629", 
      "inputs": [[51, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15066_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15066_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "name": "convolution15066", 
      "inputs": [[52, 0], [53, 0], [54, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15066_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15066_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15066", 
      "inputs": [[55, 0], [56, 0], [57, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15064_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15064_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "name": "convolution15064", 
      "inputs": [[52, 0], [59, 0], [60, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15064_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15064_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15064", 
      "inputs": [[61, 0], [62, 0], [63, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13630", 
      "inputs": [[64, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15065_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15065_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15065", 
      "inputs": [[65, 0], [66, 0], [67, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15065_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15065_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15065", 
      "inputs": [[68, 0], [69, 0], [70, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus6456", 
      "inputs": [[58, 0], [71, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13631", 
      "inputs": [[72, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15067_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15067_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15067", 
      "inputs": [[73, 0], [74, 0], [75, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15067_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15067_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15067", 
      "inputs": [[76, 0], [77, 0], [78, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13632", 
      "inputs": [[79, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15068_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15068_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15068", 
      "inputs": [[80, 0], [81, 0], [82, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15068_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15068_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15068", 
      "inputs": [[83, 0], [84, 0], [85, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus6457", 
      "inputs": [[73, 0], [86, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13633", 
      "inputs": [[87, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15069_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15069_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15069", 
      "inputs": [[88, 0], [89, 0], [90, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15069_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15069_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15069", 
      "inputs": [[91, 0], [92, 0], [93, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13634", 
      "inputs": [[94, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15070_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15070_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15070", 
      "inputs": [[95, 0], [96, 0], [97, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15070_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15070_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15070", 
      "inputs": [[98, 0], [99, 0], [100, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus6458", 
      "inputs": [[88, 0], [101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13635", 
      "inputs": [[102, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15073_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15073_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "name": "convolution15073", 
      "inputs": [[103, 0], [104, 0], [105, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15073_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15073_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15073", 
      "inputs": [[106, 0], [107, 0], [108, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15071_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15071_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "name": "convolution15071", 
      "inputs": [[103, 0], [110, 0], [111, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15071_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15071_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15071", 
      "inputs": [[112, 0], [113, 0], [114, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13636", 
      "inputs": [[115, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15072_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15072_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15072", 
      "inputs": [[116, 0], [117, 0], [118, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15072_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15072_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15072", 
      "inputs": [[119, 0], [120, 0], [121, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus6459", 
      "inputs": [[109, 0], [122, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13637", 
      "inputs": [[123, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15074_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15074_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15074", 
      "inputs": [[124, 0], [125, 0], [126, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15074_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15074_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15074", 
      "inputs": [[127, 0], [128, 0], [129, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13638", 
      "inputs": [[130, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15075_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15075_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15075", 
      "inputs": [[131, 0], [132, 0], [133, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15075_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15075_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15075", 
      "inputs": [[134, 0], [135, 0], [136, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus6460", 
      "inputs": [[124, 0], [137, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13639", 
      "inputs": [[138, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15076_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15076_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15076", 
      "inputs": [[139, 0], [140, 0], [141, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15076_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15076_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15076", 
      "inputs": [[142, 0], [143, 0], [144, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13640", 
      "inputs": [[145, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15077_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15077_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15077", 
      "inputs": [[146, 0], [147, 0], [148, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15077_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15077_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15077", 
      "inputs": [[149, 0], [150, 0], [151, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus6461", 
      "inputs": [[139, 0], [152, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13641", 
      "inputs": [[153, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "global_pool": "False", 
        "kernel": "(7,7)", 
        "pad": "(0,0)", 
        "pool_type": "avg", 
        "pooling_convention": "valid", 
        "stride": "(1,1)"
      }, 
      "name": "pooling717", 
      "inputs": [[154, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Flatten", 
      "param": {}, 
      "name": "flatten", 
      "inputs": [[155, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fc1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fc1_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1"
      }, 
      "name": "fc1", 
      "inputs": [[156, 0], [157, 0], [158, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "LogReg_label", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LogisticRegressionOutput", 
      "param": {"grad_scale": "1"}, 
      "name": "LogReg", 
      "inputs": [[159, 0], [160, 0]], 
      "backward_source_id": -1
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    8, 
    9, 
    11, 
    12, 
    15, 
    16, 
    18, 
    19, 
    23, 
    24, 
    26, 
    27, 
    30, 
    31, 
    33, 
    34, 
    38, 
    39, 
    41, 
    42, 
    45, 
    46, 
    48, 
    49, 
    53, 
    54, 
    56, 
    57, 
    59, 
    60, 
    62, 
    63, 
    66, 
    67, 
    69, 
    70, 
    74, 
    75, 
    77, 
    78, 
    81, 
    82, 
    84, 
    85, 
    89, 
    90, 
    92, 
    93, 
    96, 
    97, 
    99, 
    100, 
    104, 
    105, 
    107, 
    108, 
    110, 
    111, 
    113, 
    114, 
    117, 
    118, 
    120, 
    121, 
    125, 
    126, 
    128, 
    129, 
    132, 
    133, 
    135, 
    136, 
    140, 
    141, 
    143, 
    144, 
    147, 
    148, 
    150, 
    151, 
    157, 
    158, 
    160
  ], 
  "heads": [[161, 0]]
}